#include "menu.h"

void print_main_menu(void)
{
    printf("=========================Бинарное дерево поиска========================\n"
           "|| 1. Добавить узлы из файла                                         ||\n"
           "|| 2. Удалить узел                                                   ||\n"
           "|| 3. Количество вершин, начинающихся на указанную букву             ||\n"
           "|| 4. Вывести дерево                                                 ||\n"
           "=================================Другое================================\n"
           "|| 5. Сравнить сортировку                                            ||\n"
           "|| 6. Сравнить поиск                                                 ||\n"
           "|| 0. Выход                                                          ||\n"
           "=======================================================================\n");
}
