#include "menu.h"

void print_main_menu(void)
{
    printf("=========================Бинарное дерево поиска========================\n"
           "|| 1. Считать данные из файла                                        ||\n"
           "|| 2. Добавить узел                                                  ||\n"
           "|| 3. Удалить узел                                                   ||\n"
           "|| 4. Количество вершин, начинающихся на указанную букву             ||\n"
           "|| 5. Вывести дерево                                                 ||\n"
           "|| 6. Поиск слова в дереве                                           ||\n"
           "=================================Другое================================\n"
           "|| 7. Сравнить сортировку                                            ||\n"
           "|| 8. Сравнить поиск                                                 ||\n"
           "|| 9. Сравнить поиск в файле и в дереве                              ||\n"
           "|| 0. Выход                                                          ||\n"
           "=======================================================================\n");
}
